{
 "class_name": "Sequential",
 "config": {
  "name": "sequential_1",
  "layers": [
   {
    "class_name": "Conv1D",
    "config": {
     "name": "conv0",
     "trainable": true,
     "batch_input_shape": [
      null,
      16,
      3
     ],
     "dtype": "float32",
     "filters": 4,
     "kernel_size": [
      2
     ],
     "strides": [
      1
     ],
     "padding": "same",
     "data_format": "channels_last",
     "dilation_rate": [
      2
     ],
     "activation": "sigmoid",
     "use_bias": true,
     "kernel_initializer": {
      "class_name": "VarianceScaling",
      "config": {
       "scale": 1.0,
       "mode": "fan_avg",
       "distribution": "uniform",
       "seed": null
      }
     },
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "kernel_regularizer": null,
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "bias_constraint": null
    }
   }
  ]
 },
 "keras_version": "2.3.1",
 "backend": "tensorflow"
}
