{
 "class_name": "Sequential",
 "config": {
  "name": "sequential_1",
  "layers": [
   {
    "class_name": "Dense",
    "config": {
     "name": "dense",
     "trainable": true,
     "batch_input_shape": [
      null,
      16
     ],
     "dtype": "float32",
     "units": 32,
     "activation": "linear",
     "use_bias": true,
     "kernel_initializer": {
      "class_name": "VarianceScaling",
      "config": {
       "scale": 1.0,
       "mode": "fan_avg",
       "distribution": "uniform",
       "seed": null
      }
     },
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "kernel_regularizer": null,
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "bias_constraint": null
    }
   },
   {
    "class_name": "ReLU",
    "config": {
     "name": "re_lu_1",
     "trainable": true,
     "dtype": "float32",
     "max_value": 6.0,
     "negative_slope": 0.0,
     "threshold": 0.0
    }
   }
  ]
 },
 "keras_version": "2.3.1",
 "backend": "tensorflow"
}
